In [1]:
import pandas as pd;import numpy as np
url='https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv'

nombres_bebes=pd.read_csv(url)

In [4]:
nombres_bebes

         Unnamed: 0       Id     Name  Year Gender State  Count
0             11349    11350     Emma  2004      F    AK     62
1             11350    11351  Madison  2004      F    AK     48
2             11351    11352   Hannah  2004      F    AK     46
3             11352    11353    Grace  2004      F    AK     44
4             11353    11354    Emily  2004      F    AK     41
...             ...      ...      ...   ...    ...   ...    ...
1016390     5647421  5647422     Seth  2014      M    WY      5
1016391     5647422  5647423  Spencer  2014      M    WY      5
1016392     5647423  5647424     Tyce  2014      M    WY      5
1016393     5647424  5647425   Victor  2014      M    WY      5
1016394     5647425  5647426   Waylon  2014      M    WY      5

[1016395 rows x 7 columns]

In [5]:
nombres_bebes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1016395 entries, 0 to 1016394
Data columns (total 7 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   Unnamed: 0  1016395 non-null  int64
 1   Id          1016395 non-null  int64
 2   Name        1016395 non-null  object
 3   Year        1016395 non-null  int64
 4   Gender      1016395 non-null  object
 5   State       1016395 non-null  object
 6   Count       1016395 non-null  int64
dtypes: int64(4), object(3)
memory usage: 54.3+ MB

In [17]:
nombres_bebes.drop(['Unnamed: 0','Id'],axis=1,inplace=True)

In [18]:
nombres_bebes.Gender.value_counts().sort_values(ascending=False)  ###Hay mas nombres de mujeres en la DB

F    558846
M    457549
Name: Gender, dtype: int64

In [34]:
nombres=nombres_bebes.groupby('Name').sum()
nombres.sort_values(by='Count',ascending=False) ###Imprimir los nombres en orden descendente

             Count
Name
Jacob       242874
Emma        214852
Michael     214405
Ethan       209277
Isabella    204798
...            ...
Eniola           5
Atlantis         5
Marci            5
Simarpreet       5
Nita             5

[17632 rows x 1 columns]

In [38]:
nombres.shape[0] ###Cantidad de nombres diferentes en la DB

17632

In [39]:
nombres.sort_values('Count',ascending=False).head(1)  ###El nombre con mas ocurrencias dentro de la lista

        Count
Name
Jacob  242874

In [62]:
nombres[nombres['Count']==int(nombres.Count.sort_values().head(1).values)].count()
###Cantidad de nombres diferentes con la menos ocurrencia dentro de la lista

Count    2578
dtype: int64

In [66]:
nombres[nombres.Count==nombres.Count.min()].size  ### Otra alternativa para encontrar el valor anterior

2578

In [67]:
nombres.Count.describe()  ##Resumen con los principales resumenes estadísticos, para qué?

count     17632.000000
mean       2008.932169
std       11006.069468
min           5.000000
25%          11.000000
50%          49.000000
75%         337.000000
max      242874.000000
Name: Count, dtype: float64